
#include <REGX52.H>

void Timer0_Init()
{
    TMOD &=0xf0; //设置定时器0为模式1
    TMOD |=0x01; 
    TH0=(65535-50000)/256; //设置定时器初值
    TL0=(65535-50000)%256; 
    ET0=1; //允许定时器0中断
    EA=1; //允许总中断
    TR0=1; //启动定时器0
}

void Timer1_Init()
{
    TMOD &=0x0f; //设置定时器1为模式1
    TMOD |=0x10; 
    
    TH1=(65535-50000)/256; //设置定时器初值
    TL1=(65535-50000)%256; 
    ET1=1; //允许定时器1中断
    EA=1; //允许总中断
    TR1=1; //启动定时器1
}



void Timer0() interrupt 1
{
    TH0=(65535-50000)/256;
    TL0=(65535-50000)%256;
    count++;
    if (count>20)
    P2_1=~P2_1,count=0;
}


